1s/ERP/Conf/InformationRegisters/Лико_СерииНоменклатурыДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_СерииНоменклатурыДоп</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗапаса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссионныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияДавальца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажи</Name>
					<Comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНаХраненииСПравомПродажиПереданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственныйТоварПоНеотфактурованнойПоставке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АгентскаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ФормированиеПаллета2_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ФормированиеПаллета2_0</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ПараметрыПаллет</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ТоварыНаПаллетах</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ПаллетыВСекциях</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>InformationRegister.Лико_СерииНоменклатурыДоп</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыПаллет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_СерииНоменклатурыДоп/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(Регистратор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистраторОбъект = ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Регистратор)),Регистратор.ПолучитьОбъект(),Регистратор);
	
	МассивСерий = Новый Массив();
	
	СерииПоПриходномуОрдеру(РегистраторОбъект,МассивСерий); 
	СерииПоЗакрытиюБланка(РегистраторОбъект,МассивСерий);
	СерииПоЛико_ВозвратТоваров(РегистраторОбъект,МассивСерий);
	СерииПоФормированиюПаллета(РегистраторОбъект,МассивСерий); 
	
	СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий);

	
КонецПроцедуры 

Функция РегистраторПоСерии(Серия, Период=Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Период = ?(Период = Неопределено, ТекущаяДата(), Период);
	
	Результат = Неопределено;		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТоварыНаСкладах.Период) КАК Период,
	|	ТоварыНаСкладах.Серия КАК Серия,
	|	ТоварыНаСкладах.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистратор
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Серия = &Серия
	|	И ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТоварыНаСкладах.Период <= &Период
	|	И (ТоварыНаСкладах.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
	|			ИЛИ ТоварыНаСкладах.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа
	|			ИЛИ ТоварыНаСкладах.Регистратор ССЫЛКА Документ.Лико_ВозвратТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладах.Серия,
	|	ТоварыНаСкладах.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период,
	|	ВложенныйЗапрос.Серия КАК Серия
	|ПОМЕСТИТЬ ВтМаксПериодСерии
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.Серия КАК Серия
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ВтРегистратор.Период КАК Период,
	|			ВтРегистратор.Серия КАК Серия,
	|			ВЫРАЗИТЬ(ВтРегистратор.Регистратор КАК Документ.ПриходныйОрдерНаТовары) КАК Регистратор
	|		ИЗ
	|			ВтРегистратор КАК ВтРегистратор
	|		ГДЕ
	|			ВтРегистратор.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары) КАК ВложенныйЗапрос
	|	ГДЕ
	|		ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВтРегистратор.Период,
	|		ВтРегистратор.Серия
	|	ИЗ
	|		ВтРегистратор КАК ВтРегистратор
	|	ГДЕ
	|		(ВтРегистратор.Регистратор ССЫЛКА Документ.Лико_БланкЭтапа
	|				ИЛИ ВтРегистратор.Регистратор ССЫЛКА Документ.Лико_ВозвратТоваров)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТоварыНаСкладах.Регистратор) КАК Регистратор
	|ИЗ
	|	ВтМаксПериодСерии КАК ВтМаксПериодСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|		ПО ВтМаксПериодСерии.Серия = ТоварыНаСкладах.Серия
	|			И ВтМаксПериодСерии.Период = ТоварыНаСкладах.Период";
	
	
	 ДополнитьЗапросРаспоряжениямиДляЗаписиСерий(Запрос);	
	
	Запрос.УстановитьПараметр("Серия",Серия );
	Запрос.УстановитьПараметр("Период",Период );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Результат = выборка.Регистратор;
	
	КонецЦикла; 
	
   Возврат Результат;
КонецФункции

Функция ОрганизацияВладельцаТовара(Серия, Период = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	Период = ?(Период = Неопределено, ТекущаяДата(), Период);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса.ТипЗапасов В (&МассивТиповзапаса)
	|			ТОГДА Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса.ВладелецТовара
	|		ИНАЧЕ Лико_СерииНоменклатурыДопСрезПоследних.Организация
	|	КОНЕЦ КАК ВладелецТовара
	|ИЗ
	|	РегистрСведений.Лико_СерииНоменклатурыДоп.СрезПоследних(&Период, Серия = &Серия) КАК Лико_СерииНоменклатурыДопСрезПоследних";
	Запрос.УстановитьПараметр("Серия",Серия ); 
	Запрос.УстановитьПараметр("Период",Период );
	
	МассивТиповзапаса= Новый Массив;
	МассивТиповзапаса.Добавить(Перечисления.ТипыЗапасов.МатериалДавальца);
	МассивТиповзапаса.Добавить(Перечисления.ТипыЗапасов.ПродукцияДавальца);
	
	Запрос.УстановитьПараметр("МассивТиповзапаса",МассивТиповзапаса );
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.ВладелецТовара;
	КонецЦикла; 

	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Партнеры") Тогда
		
		Результат = УправлениеСвойствами.ЗначениеСвойства(Результат,"Лико_СобственнаяОрганизация");
		
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции  



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СерииПоПриходномуОрдеру(РегистраторОбъект,МассивСерий) 
	
	Если ТипЗнч(РегистраторОбъект)<> Тип("ДокументОбъект.ПриходныйОрдерНаТовары") 
		Или ЭтоРаспоряжениеДляЗаписиСерий(РегистраторОбъект.Распоряжение) = Ложь Тогда
		
		Возврат;
		
	КонецЕсли;	
	//РегистраторОбъект = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент(); 
	МассивСерий = Новый Массив();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯССМ_ОбъектыНоменклатуры.Серия КАК Серия
	|ИЗ
	|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|ГДЕ
	|	ЯССМ_ОбъектыНоменклатуры.Серия В(&МассивСерий)
	|	И ЯССМ_ОбъектыНоменклатуры.Уникальный";
	Запрос.УстановитьПараметр("МассивСерий",РегистраторОбъект.Товары.Выгрузить().ВыгрузитьКолонку("Серия"));
	
	МассивСерий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия"); 
	
	//СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий);
	
КонецПроцедуры 

Процедура СерииПоЗакрытиюБланка(РегистраторОбъект,МассивСерий)
	
	Если ТипЗнч(РегистраторОбъект)<> Тип("ДокументОбъект.Лико_БланкЭтапа")   Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//РегистраторОбъект = Документы.Лико_БланкЭтапа.СоздатьДокумент(); 
	Если РегистраторОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		
		тзТоварыНаСкладах = РегистраторОбъект.Движения.ТоварыНаСкладах.Выгрузить(); 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладах.Период КАК Период,
		|	ТоварыНаСкладах.Регистратор КАК Регистратор,
		|	ТоварыНаСкладах.НомерСтроки КАК НомерСтроки,
		|	ТоварыНаСкладах.Активность КАК Активность,
		|	ТоварыНаСкладах.ВидДвижения КАК ВидДвижения,
		|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладах.Характеристика КАК Характеристика,
		|	ТоварыНаСкладах.Назначение КАК Назначение,
		|	ТоварыНаСкладах.Склад КАК Склад,
		|	ТоварыНаСкладах.Помещение КАК Помещение,
		|	ТоварыНаСкладах.Серия КАК Серия,
		|	ТоварыНаСкладах.ВНаличии КАК ВНаличии,
		|	ТоварыНаСкладах.КОтгрузке КАК КОтгрузке,
		|	ТоварыНаСкладах.КонтролироватьОстатки КАК КонтролироватьОстатки,
		|	ТоварыНаСкладах.Сторно КАК Сторно
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|ГДЕ
		|	ТоварыНаСкладах.Регистратор = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор",РегистраторОбъект.Ссылка );
		
		тзТоварыНаСкладах = Запрос.Выполнить().Выгрузить();		
		
	КонецЕсли;
	
	МассивСерий = Новый Массив();
	
	Для каждого Выпуск Из РегистраторОбъект.Выпуск Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Серия",Выпуск.Серия);
		
		Если тзТоварыНаСкладах.НайтиСтроки(Структура).Количество() > 0 Тогда
			
			МассивСерий.Добавить(Выпуск.Серия);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий);
	
КонецПроцедуры 

Процедура СерииПоЛико_ВозвратТоваров(РегистраторОбъект,МассивСерий)
	
	Если  ТипЗнч(РегистраторОбъект)<> Тип("ДокументОбъект.Лико_ВозвратТоваров") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//РегистраторОбъект = Документы.Лико_БланкЭтапа.СоздатьДокумент(); 
	Если РегистраторОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		
		тзТоварыНаСкладах = РегистраторОбъект.Движения.ТоварыНаСкладах.Выгрузить(); 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладах.Период КАК Период,
		|	ТоварыНаСкладах.Регистратор КАК Регистратор,
		|	ТоварыНаСкладах.НомерСтроки КАК НомерСтроки,
		|	ТоварыНаСкладах.Активность КАК Активность,
		|	ТоварыНаСкладах.ВидДвижения КАК ВидДвижения,
		|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладах.Характеристика КАК Характеристика,
		|	ТоварыНаСкладах.Назначение КАК Назначение,
		|	ТоварыНаСкладах.Склад КАК Склад,
		|	ТоварыНаСкладах.Помещение КАК Помещение,
		|	ТоварыНаСкладах.Серия КАК Серия,
		|	ТоварыНаСкладах.ВНаличии КАК ВНаличии,
		|	ТоварыНаСкладах.КОтгрузке КАК КОтгрузке,
		|	ТоварыНаСкладах.КонтролироватьОстатки КАК КонтролироватьОстатки,
		|	ТоварыНаСкладах.Сторно КАК Сторно
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|ГДЕ
		|	ТоварыНаСкладах.Регистратор = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор",РегистраторОбъект.Ссылка );
		
		тзТоварыНаСкладах = Запрос.Выполнить().Выгрузить();		
		
	КонецЕсли;
	
	МассивСерий = Новый Массив();
	
	Для каждого Товар Из РегистраторОбъект.Товары Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("Серия",Товар.Серия);
		
		Если тзТоварыНаСкладах.НайтиСтроки(Структура).Количество() > 0 Тогда
			
			МассивСерий.Добавить(Товар.Серия);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий);
	
КонецПроцедуры 

Процедура СерииПоФормированиюПаллета(РегистраторОбъект,МассивСерий) 
	
	Если ТипЗнч(РегистраторОбъект)<> Тип("ДокументОбъект.Лико_ФормированиеПаллета2_0")  Тогда
		
		Возврат;
		
	КонецЕсли;	
	МассивСерий = Новый Массив();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Лико_СерииНоменклатурыДоп.Серия) КАК КоличествоСерий,
	|	Лико_ФормированиеПаллета2_0Товары.Серия КАК Серия
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	Документ.Лико_ФормированиеПаллета2_0.Товары КАК Лико_ФормированиеПаллета2_0Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СерииНоменклатурыДоп КАК Лико_СерииНоменклатурыДоп
	|		ПО (Лико_СерииНоменклатурыДоп.Серия = Лико_ФормированиеПаллета2_0Товары.Серия)
	|			И (Лико_СерииНоменклатурыДоп.Регистратор <> &Ссылка)
	|ГДЕ
	|	Лико_ФормированиеПаллета2_0Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ФормированиеПаллета2_0Товары.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Серия КАК Серия
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	ВременнаяТаблица.КоличествоСерий = 0";
	Запрос.УстановитьПараметр("Ссылка",РегистраторОбъект.Ссылка);
	
	МассивСерий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия"); 
	
	//СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий);
	
КонецПроцедуры 



Процедура СформироватьНаборЗаписей(РегистраторОбъект,МассивСерий)
	
	Если МассивСерий.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Организация = Организация(РегистраторОбъект);
	ВидЗапаса = ВидЗапаса(РегистраторОбъект);

	

	
	НаборЗаписей = РегистрыСведений.Лико_СерииНоменклатурыДоп.СоздатьНаборЗаписей();

	
	Для каждого Серия Из МассивСерий Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(РегистраторОбъект.Ссылка);
		//НаборЗаписей.Отбор.Серия.Установить(Серия); 
		//НаборЗаписей.Отбор.Период.Установить(РегистраторОбъект.Дата); 
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор = РегистраторОбъект.Ссылка; 
		НоваяЗапись.Серия = Серия;
		НоваяЗапись.Период = РегистраторОбъект.Дата;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.ВидЗапаса = ВидЗапаса;
		
	КонецЦикла;
   НаборЗаписей.Записать();

КонецПроцедуры 

Функция ЭтоРаспоряжениеДляЗаписиСерий(Распоряжение) 
	
	Массив = Новый Массив(); 
	
	Массив.Добавить(Тип("ДокументСсылка.ЗаказДавальца"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказДавальца2_5"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказПереработчику"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказПереработчику2_5"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказПоставщику")); 
	Массив.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	Массив.Добавить(Тип("ДокументСсылка.ПрочееОприходованиеТоваров"));
	
	Возврат Массив.Найти(ТипЗнч(Распоряжение))<>Неопределено;
	
КонецФункции  

Процедура ДополнитьЗапросРаспоряжениямиДляЗаписиСерий(Запрос) 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ГДЕ
	|		ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПоставщику",
	"	ГДЕ 
	|		ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПоставщику
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказДавальца
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказДавальца2_5
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПереработчику
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ЗаказПереработчику2_5
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|		ИЛИ ВложенныйЗапрос.Регистратор.Распоряжение ССЫЛКА Документ.ПрочееОприходованиеТоваров");


КонецПроцедуры 




Функция ВидЗапаса(РегистраторОбъект)
	
	ВидЗапаса = Неопределено;
	ВидЗапасаПоПриходномуОрдеру(РегистраторОбъект, ВидЗапаса);
	ВидЗапасаПоЗакрытиюБланка(РегистраторОбъект, ВидЗапаса);
	
	
	Возврат ВидЗапаса;
	
	
КонецФункции

Процедура ВидЗапасаПоПриходномуОрдеру(РегистраторОбъект, ВидЗапаса)
	
	Если ВидЗапаса<>Неопределено 
		Или  ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	Распоряжение = РегистраторОбъект.Распоряжение;
	
	Массив = Новый Массив(); 
	
	Массив.Добавить(Тип("ДокументСсылка.ЗаказДавальца"));
	Массив.Добавить(Тип("ДокументСсылка.ЗаказДавальца2_5"));
	
	Если Массив.Найти(ТипЗнч(Распоряжение))=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыЗапасов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказДавальца КАК ЗаказДавальца
	|		ПО ВидыЗапасов.Договор = ЗаказДавальца.Договор
	|			И ВидыЗапасов.Организация = ЗаказДавальца.Организация
	|			И ВидыЗапасов.ВладелецТовара = ЗаказДавальца.Партнер
	|ГДЕ
	|	ВидыЗапасов.ТипЗапасов = &ТипЗапасов
	|	И ЗаказДавальца.Ссылка = &Распоряжение";
	Запрос.УстановитьПараметр("ТипЗапасов", Перечисления.ТипыЗапасов.МатериалДавальца); 
	Запрос.УстановитьПараметр("Распоряжение", РегистраторОбъект.Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидЗапаса = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры  

Процедура ВидЗапасаПоЗакрытиюБланка(РегистраторОбъект, ВидЗапаса)
	
	Если ВидЗапаса<>Неопределено 
		Или  ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	ВидЗапасаПоЭтапуПроизводства(РегистраторОбъект.Распоряжение, ВидЗапаса);
	
	
КонецПроцедуры  

Процедура ВидЗапасаПоЭтапуПроизводства(Этап, ВидЗапаса)
	
	Если ВидЗапаса<>Неопределено 
		Или  ТипЗнч(Этап) <> Тип("ДокументСсылка.ЭтапПроизводства2_2") Тогда 
		
		Возврат;
		
	КонецЕсли;
	
			
				
			
		РеквизитыВидаЗапасов= Новый Структура;
		РеквизитыВидаЗапасов.Вставить("Договор",Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		РеквизитыВидаЗапасов.Вставить("ВладелецТовара",Справочники.Патенты.ПустаяСсылка());
		РеквизитыВидаЗапасов.Вставить("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
		РеквизитыВидаЗапасов.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
		РеквизитыВидаЗапасов.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПустаяСсылка());
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапПроизводства2_2.Партнер КАК ВладелецТовара,
		|	ЭтапПроизводства2_2.Договор КАК Договор,
		|	ЭтапПроизводства2_2.Договор.Контрагент КАК Контрагент,
		|	ЭтапПроизводства2_2.Организация КАК Организация,
		|	ЭтапПроизводства2_2.ХозяйственнаяОперация КАК ХозяйственнаяОперация
		|ИЗ
		|	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
		|ГДЕ
		|	ЭтапПроизводства2_2.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Этап );
		РезультатЗапроса = Запрос.Выполнить(); 
		
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(РеквизитыВидаЗапасов,Выборка);
		
		КонецЦикла;
		
		ВидЗапаса = Справочники.ВидыЗапасов.ВидЗапасовДокумента(РеквизитыВидаЗапасов.Организация,
		РеквизитыВидаЗапасов.ХозяйственнаяОперация,
		РеквизитыВидаЗапасов);		
		
	
	
	
КонецПроцедуры  



Функция Организация(РегистраторОбъект) 
	
	Организация = Неопределено;
	
	ОрганизацияПоПриходномуОрдеру(РегистраторОбъект, Организация);
	ОрганизацияПоЗакрытиюБланка(РегистраторОбъект, Организация); 
	ОрганизацияПоЛико_ВозвратТоваров(РегистраторОбъект, Организация); 
	ОрганизацияПоФормированиюПаллета(РегистраторОбъект, Организация);

	
	Возврат Организация;
	
КонецФункции 

Процедура ОрганизацияПоПриходномуОрдеру(РегистраторОбъект, Организация) 
	
		
	Если Организация <> Неопределено 
		Или ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.ПриходныйОрдерНаТовары") Тогда 
		
		Возврат;
		
	КонецЕсли; 
	
Распоряжение = РегистраторОбъект.Распоряжение;
Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Распоряжение,"Организация");

КонецПроцедуры 

Процедура ОрганизацияПоЛико_ВозвратТоваров(РегистраторОбъект, Организация) 
	
		
	Если Организация <> Неопределено 
		Или ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.Лико_ВозвратТоваров") Тогда 
		
		Возврат;
		
	КонецЕсли; 
	

Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистраторОбъект.Ссылка,"Организация");

КонецПроцедуры 


Процедура ОрганизацияПоЗакрытиюБланка(РегистраторОбъект, Организация) 
	
		
	Если Организация <> Неопределено 
		Или ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда 
		
		Возврат;
		
	КонецЕсли; 
	

	Если ЗначениеЗаполнено(РегистраторОбъект.ЗаказНаРаскрой) Тогда
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистраторОбъект.ЗаказНаРаскрой,"Организация");
		
	ИначеЕсли ЗначениеЗаполнено(РегистраторОбъект.Распоряжение) Тогда
		
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистраторОбъект.Распоряжение,"Организация");

	Иначе
		
		Организация = РегистраторОбъект.Организация;
		
	КонецЕсли;

КонецПроцедуры 


Процедура ОрганизацияПоФормированиюПаллета(РегистраторОбъект, Организация) 
	
		
	Если Организация <> Неопределено 
		Или ТипЗнч(РегистраторОбъект) <> Тип("ДокументОбъект.Лико_ФормированиеПаллета2_0") Тогда 
		
		Возврат;
		
	КонецЕсли; 
	

Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегистраторОбъект.АдресХранения,"Лико_Организация");

КонецПроцедуры 


#КонецОбласти

#КонецЕсли
